app/controllers/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."id" = 6 LIMIT 1
---
	def show
		@place = Place.find_by(:id => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 16 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 16
---
	def delete
		@place = Place.find_by(:id => params["id"])
		@place.delete

INSERT INTO "places" ("admission_price", "description", "photo_url", "title") VALUES (?, ?, ?, ?)
---
	def create
		Place.create(:title => params["title"], :photo_url => params["photo_url"], :admission_price => params["admission_price"], :description => params["description"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 19 LIMIT 1
---
	def edit
		@place = Place.find_by(:id => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1
UPDATE "places" SET "photo_url" = ? WHERE "places"."id" = 26  [["photo_url", "https://upload.wikimedia.org/wikipedia/commons/d/d2/Chiang_Kai-shek_memorial_amk.jpg"]]
---
	def update
		@place = Place.find_by(:id => params["id"])
		@place.title = params["title"]
		@place.photo_url = params["photo_url"]
		@place.admission_price = params["admission_price"]
		@place.description = params["description"]
		@place.save